app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "show_permission" = ?, "edit_permission" = ?, "delete_permission" = ?, "comment_permission" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["show_permission", "t"], ["edit_permission", "t"], ["delete_permission", "t"], ["comment_permission", "t"], ["updated_at", "2015-02-25 07:30:29.952900"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])

    if @user.update(params.require(:user).permit(:show_permission, :edit_permission, :delete_permission, :comment_permission))

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
  	@user = User.new(params.require(:user).permit(:email, :password, :password_confirmation))

  	if @user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "divyanshu@nowhere.com"]]
---
  def attempt_login

    if params[:user][:email].present? && params[:user][:password].present?